import { ICategory } from "./popularCategories";

const categories: ICategory[] = [
  {
    name: "Сантехника",
    url: "#",
    imageSrc: "/plumbing.png",
    subCategories: [
      {
        name: "Ванны",
        url: "#",
      },
      {
        name: "Комплектующие для ванн",
        url: "#",
      },
      {
        name: "Душевые",
        url: "#",
      },
      {
        name: "Унитазы и биде",
        url: "#",
      },
      {
        name: "Смесители",
        url: "#",
      },
      {
        name: "Душевое оборудование",
        url: "#",
      },
      {
        name: "Раковины",
        url: "#",
      },
      {
        name: "Пьедесталы для раковин",
        url: "#",
      },
    ],
  },
  {
    name: "Стройматериалы",
    url: "#",
    imageSrc: "/lumber.png",
    subCategories: [
      {
        name: "Сухие смеси",
        url: "#",
      },
      {
        name: "Пиломатериалы",
        url: "#",
      },
      {
        name: "Гипсокартон",
        url: "#",
      },
      {
        name: "Профиль для гипсокартона",
        url: "#",
      },
      {
        name: "Изоляционные материалы",
        url: "#",
      },
      {
        name: "Армирующие материалы",
        url: "#",
      },
      {
        name: "Кровля",
        url: "#",
      },
      {
        name: "Ленты строительные",
        url: "#",
      },
    ],
  },
  {
    name: "Напольные покрытия",
    url: "#",
    imageSrc: "/linoleum.png",
    subCategories: [
      {
        name: "Линолеум",
        url: "#",
      },
      {
        name: "Ламинат",
        url: "#",
      },
      {
        name: "Ковролин",
        url: "#",
      },
      {
        name: "Плинтус напольный",
        url: "#",
      },
      {
        name: "Пороги",
        url: "#",
      },
      {
        name: "Подложки",
        url: "#",
      },
      {
        name: "Ковровые дорожки",
        url: "#",
      },
      {
        name: "Плитка ПВХ, виниловый ламинат",
        url: "#",
      },
    ],
  },
  {
    name: "Отделка стен и потолка",
    url: "#",
    imageSrc: "/wallpaper.png",
    subCategories: [
      {
        name: "Обои",
        url: "#",
      },
      {
        name: "Стеновые панели",
        url: "#",
      },
      {
        name: "Плинтус потолочный",
        url: "#",
      },
      {
        name: "Углы к потолочному плинтусу",
        url: "#",
      },
      {
        name: "Потолочная плитка",
        url: "#",
      },
      {
        name: "Профили алюминиевые",
        url: "#",
      },
      {
        name: "Декоративные молдинги, багеты",
        url: "#",
      },
      {
        name: "Пленки самоклеящиеся",
        url: "#",
      },
    ],
  },
  {
    name: "Керамическая плитка",
    url: "#",
    imageSrc: "/ceramic.png",
    subCategories: [
      {
        name: "Настенная плитка",
        url: "#",
      },
      {
        name: "Напольная плитка",
        url: "#",
      },
      {
        name: "Керамогранит",
        url: "#",
      },
      {
        name: "Декоративная плитка",
        url: "#",
      },
      {
        name: "Системы выравнивания плитки",
        url: "#",
      },
      {
        name: "Уголки и профили для плитки",
        url: "#",
      },
      {
        name: "Керамический плинтус",
        url: "#",
      },
      {
        name: "Мозаика",
        url: "#",
      },
    ],
  },
  {
    name: "Двери и окна",
    url: "#",
    imageSrc: "/windows.png",
    subCategories: [
      {
        name: "Межкомнатные двери",
        url: "#",
      },
      {
        name: "Входные двери",
        url: "#",
      },
      {
        name: "Дверные коробки",
        url: "#",
      },
      {
        name: "Арки",
        url: "#",
      },
      {
        name: "Дверные наличники",
        url: "#",
      },
      {
        name: "Дверные доборы",
        url: "#",
      },
      {
        name: "Раздвижные двери",
        url: "#",
      },
      {
        name: "Скобяные изделия",
        url: "#",
      },
    ],
  },
  {
    name: "Лакокрасочные материалы",
    url: "#",
    imageSrc: "/paints.png",
    subCategories: [
      {
        name: "Краски",
        url: "#",
      },
      {
        name: "Эмали",
        url: "#",
      },
      {
        name: "Грунтовки",
        url: "#",
      },
      {
        name: "Монтажные пены",
        url: "#",
      },
      {
        name: "Герметики",
        url: "#",
      },
      {
        name: "Клеи",
        url: "#",
      },
      {
        name: "Покрытия для дерева",
        url: "#",
      },
      {
        name: "Лаки",
        url: "#",
      },
    ],
  },
  {
    name: "Климат и отопление",
    url: "#",
    imageSrc: "/climate.png",
    subCategories: [
      {
        name: "Радиаторы отопления",
        url: "#",
      },
      {
        name: "Теплый пол",
        url: "#",
      },
      {
        name: "Электрические камины",
        url: "#",
      },
      {
        name: "Вентиляция",
        url: "#",
      },
      {
        name: "Тепловое оборудование",
        url: "#",
      },
      {
        name: "Котлы отопительные",
        url: "#",
      },
      {
        name: "Расширительные баки",
        url: "#",
      },
      {
        name: "Насосы циркуляционные",
        url: "#",
      },
    ],
  },
  {
    name: "Инструменты",
    url: "#",
    imageSrc: "/tools.png",
    subCategories: [
      {
        name: "Электроинструмент",
        url: "#",
      },
      {
        name: "Расходные материалы",
        url: "#",
      },
      {
        name: "Малярный инструмент",
        url: "#",
      },
      {
        name: "Штукатурный инструмент",
        url: "#",
      },
      {
        name: "Шлифовальный инструмент",
        url: "#",
      },
      {
        name: "Измерительный инструмент",
        url: "#",
      },
      {
        name: "Шпатели",
        url: "#",
      },
      {
        name: "Спецодежда и средства защиты",
        url: "#",
      },
    ],
  },
  {
    name: "Крепеж и фурнитура",
    url: "#",
    imageSrc: "/furniture.png",
    subCategories: [
      {
        name: "Саморезы",
        url: "#",
      },
      {
        name: "Дюбель",
        url: "#",
      },
      {
        name: "Гвозди",
        url: "#",
      },
      {
        name: "Анкер",
        url: "#",
      },
      {
        name: "Болты",
        url: "#",
      },
      {
        name: "Гайки",
        url: "#",
      },
      {
        name: "Шуруп",
        url: "#",
      },
      {
        name: "Шайбы",
        url: "#",
      },
    ],
  },
  {
    name: "Освещение",
    url: "#",
    imageSrc: "/interior.png",
    subCategories: [
      {
        name: "Лампы",
        url: "#",
      },
      {
        name: "Люстры",
        url: "#",
      },
      {
        name: "Потолочные светильники",
        url: "#",
      },
      {
        name: "Светодиодные светильники",
        url: "#",
      },
      {
        name: "Подвесные светильники",
        url: "#",
      },
      {
        name: "Светодиодные панели",
        url: "#",
      },
      {
        name: "Бра",
        url: "#",
      },
      {
        name: "Настольные лампы",
        url: "#",
      },
    ],
  },
  {
    name: "Электротовары",
    url: "#",
    imageSrc: "/electrical_goods.png",
    subCategories: [
      {
        name: "Розетки и выключатели",
        url: "#",
      },
      {
        name: "Кабели и комплектующие",
        url: "#",
      },
      {
        name: "Телекоммуникации",
        url: "#",
      },
      {
        name: "Счетчики электроэнергии",
        url: "#",
      },
      {
        name: "Автоматические выключатели",
        url: "#",
      },
      {
        name: "Электрические щитки",
        url: "#",
      },
      {
        name: "Тройники для розетки",
        url: "#",
      },
      {
        name: "Удлинители электрические",
        url: "#",
      },
    ],
  },
];

export default function allCategories() {
    return categories;
}