

const AboutBlock = () => {
  return (
    <div className="mt-10 lg:max-w-[1360px] mx-auto bg-[url('../../public/about.png')] bg-no-repeat">
      <div className="pt-[88px] pl-4 md:pl-[190px] max-w-[670px]">
        <h2 className="text-shark text-[34px] font-semibold leading-[44px]">
          О компании
        </h2>
        <p className="mt-[20px] text-shark text-[16px] font-normal leading-6 pb-[88px]">
          В СтройкаСтор вы всегда можете купить все необходимые товары для
          ремонта домаи дачи. Хотите сделать ремонт в квартире? Строите
          загородный дом? Используйте строительные и отделочные материалы из
          нашего каталога. Быстрая доставка строительных товаров по низким ценам
          сделает ваши покупки более приятными. Ремонт может стоить дешево, если
          делать его с нами. Для вас всегда в наличии более 30 000 товаров для
          строительства по низким ценам каждый день. СтройкаСтор — это широкий
          ассортимент товаров для дома и ремонта недорого; Возможность заказать
          строительные и отделочные материалы для дома и дачи.
        </p>
      </div>
    </div>
  );
};

export default AboutBlock;
